/*==============================================================================
模块名      :  CMgrAlarm
文件名      :  CMgrAlarm.h
相关文件    :  CMgrAlarm.cpp
文件实现功能:  告警数据管理，分为告警数据保存删除，界面展示通知
作者        :
版权        :  <Copyright(C) 2003-2010 Suzhou Keda Technology Co., Ltd. All rights reserved.>
-------------------------------------------------------------------------------
修改记录    :
日  期         版本          修改人          走读人          修改记录
2015/12/28     1.0           刘登科                          创建
==============================================================================*/

#pragma once
#include "stdafx.h"


////////////////////////////////////////////////////////////////////////

class CMgrAlarm :public CCriticalObject
{
public:
	CMgrAlarm(void *pData);
	~CMgrAlarm();
public:

	/*=================================================================
	函数名称: Init
	功    能: 初始化
	参数说明:
	返 回 值: 无
	=================================================================*/
	void	Init();
	void    Release();

	/*=================================================================
	函数名称:
	功    能: 添加、删除
	参数说明:
	返 回 值: 无
	=================================================================*/
	void	Clear();
	void	AddAlarm(PTALARMINFO_ITS p);
	void	DelAlarm(PTALARMINFO_ITS p);
	void	DelAlarm(u32 dwAlarmId);
	PTALARMINFO_ITS	GetAlarm(u32 dwAlarmId);

	/*=================================================================
	函数名称:
	功    能: 通知界面
	参数说明:
	返 回 值: 无
	=================================================================*/
	void	Notify(u32 dwAlarmId);


protected:
	//CMgrData*			m_pMgrData;
	u32					m_dwMapKey;
	TMAPALARMINFO		m_mapAlarmInfo;
};


